[
  {
    "Name": "Code Generator",
    "SearchText": "write me a simple class that adds 2 numbers together and write a unit test using xunit , an API Controller and then a HttpClient To call the API",
    "System": "You are a code generator, when generating code markdown ensure to include the language e.g c# should start with ```csharp. dont give any explanations or description code only",
    "Assistant": ""
  },
  {
    "Name": "Extract Personal Details",
    "SearchText": "extract the person details",
    "System": "respond only with machine readable JSON format",
    "Assistant": "Paul Newman 1985 london uk"
  },
  {
    "Name": "Quiz Generator",
    "SearchText": "movies, music , geography",
    "System": "You are a general knowledge quiz master. When I enter categories generate 10 mixed multiple choice questions in total based on the topics. Include the answer in a seperate field.\r\nrespond only with machine readable JSON format",
    "Assistant": ""
  },
  {
    "Name": "Support Assistant",
    "SearchText": "How do I fix my issue?",
    "System": "You are a helpfull support agent",
    "Assistant": "Ticket : 1024, Title : Unable to send emails, Content : Unable to connect to SMTP server"
  },
  {
    "Name": "Natural Language to Sql",
    "SearchText": "how many customers orders did we have in the last month and what was the total order value?",
    "System": "You are a natural language to SQL generator.Respond only with valid T SQL",
    "Assistant": "CREATE TABLE [dbo].[Categories](\r\n\t[CategoryID] [int] IDENTITY(1,1) NOT NULL,\r\n\t[CategoryName] [nvarchar](15) NOT NULL,\r\n\t[Description] [ntext] NULL,\r\n\t[Picture] [image] NULL\r\n) \r\nCREATE TABLE [dbo].[Customers](\r\n\t[CustomerID] [nchar](5) NOT NULL,\r\n\t[CompanyName] [nvarchar](40) NOT NULL,\r\n\t[ContactName] [nvarchar](30) NULL,\r\n\t[ContactTitle] [nvarchar](30) NULL,\r\n\t[Address] [nvarchar](60) NULL,\r\n\t[City] [nvarchar](15) NULL,\r\n\t[Region] [nvarchar](15) NULL,\r\n\t[PostalCode] [nvarchar](10) NULL,\r\n\t[Country] [nvarchar](15) NULL,\r\n\t[Phone] [nvarchar](24) NULL,\r\n\t[Fax] [nvarchar](24) NULL\r\n) \r\nCREATE TABLE [dbo].[Order Details](\r\n\t[OrderID] [int] NOT NULL,\r\n\t[ProductID] [int] NOT NULL,\r\n\t[UnitPrice] [money] NOT NULL,\r\n\t[Quantity] [smallint] NOT NULL,\r\n\t[Discount] [real] NOT NULL\r\n)\r\nCREATE TABLE [dbo].[Orders](\r\n\t[OrderID] [int] IDENTITY(1,1) NOT NULL,\r\n\t[CustomerID] [nchar](5) NULL,\r\n\t[EmployeeID] [int] NULL,\r\n\t[OrderDate] [datetime] NULL,\r\n\t[RequiredDate] [datetime] NULL,\r\n\t[ShippedDate] [datetime] NULL,\r\n\t[ShipVia] [int] NULL,\r\n\t[Freight] [money] NULL,\r\n\t[ShipName] [nvarchar](40) NULL,\r\n\t[ShipAddress] [nvarchar](60) NULL,\r\n\t[ShipCity] [nvarchar](15) NULL,\r\n\t[ShipRegion] [nvarchar](15) NULL,\r\n\t[ShipPostalCode] [nvarchar](10) NULL,\r\n\t[ShipCountry] [nvarchar](15) NULL\r\n) \r\nCREATE TABLE [dbo].[Products](\r\n\t[ProductID] [int] IDENTITY(1,1) NOT NULL,\r\n\t[ProductName] [nvarchar](40) NOT NULL,\r\n\t[SupplierID] [int] NULL,\r\n\t[CategoryID] [int] NULL,\r\n\t[QuantityPerUnit] [nvarchar](20) NULL,\r\n\t[UnitPrice] [money] NULL,\r\n\t[UnitsInStock] [smallint] NULL,\r\n\t[UnitsOnOrder] [smallint] NULL,\r\n\t[ReorderLevel] [smallint] NULL,\r\n\t[Discontinued] [bit] NOT NULL\r\n)\r\nCREATE TABLE [dbo].[Customers](\r\n\t[CustomerID] [nchar](5) NOT NULL,\r\n\t[CompanyName] [nvarchar](40) NOT NULL,\r\n\t[ContactName] [nvarchar](30) NULL,\r\n\t[ContactTitle] [nvarchar](30) NULL,\r\n\t[Address] [nvarchar](60) NULL,\r\n\t[City] [nvarchar](15) NULL,\r\n\t[Region] [nvarchar](15) NULL,\r\n\t[PostalCode] [nvarchar](10) NULL,\r\n\t[Country] [nvarchar](15) NULL,\r\n\t[Phone] [nvarchar](24) NULL,\r\n\t[Fax] [nvarchar](24) NULL\r\n) \r\nCREATE TABLE [dbo].[Order Details](\r\n\t[OrderID] [int] NOT NULL,\r\n\t[ProductID] [int] NOT NULL,\r\n\t[UnitPrice] [money] NOT NULL,\r\n\t[Quantity] [smallint] NOT NULL,\r\n\t[Discount] [real] NOT NULL\r\n)\r\nCREATE TABLE [dbo].[Orders](\r\n\t[OrderID] [int] IDENTITY(1,1) NOT NULL,\r\n\t[CustomerID] [nchar](5) NULL,\r\n\t[EmployeeID] [int] NULL,\r\n\t[OrderDate] [datetime] NULL,\r\n\t[RequiredDate] [datetime] NULL,\r\n\t[ShippedDate] [datetime] NULL,\r\n\t[ShipVia] [int] NULL,\r\n\t[Freight] [money] NULL,\r\n\t[ShipName] [nvarchar](40) NULL,\r\n\t[ShipAddress] [nvarchar](60) NULL,\r\n\t[ShipCity] [nvarchar](15) NULL,\r\n\t[ShipRegion] [nvarchar](15) NULL,\r\n\t[ShipPostalCode] [nvarchar](10) NULL,\r\n\t[ShipCountry] [nvarchar](15) NULL\r\n) \r\nCREATE TABLE [dbo].[Products](\r\n\t[ProductID] [int] IDENTITY(1,1) NOT NULL,\r\n\t[ProductName] [nvarchar](40) NOT NULL,\r\n\t[SupplierID] [int] NULL,\r\n\t[CategoryID] [int] NULL,\r\n\t[QuantityPerUnit] [nvarchar](20) NULL,\r\n\t[UnitPrice] [money] NULL,\r\n\t[UnitsInStock] [smallint] NULL,\r\n\t[UnitsOnOrder] [smallint] NULL,\r\n\t[ReorderLevel] [smallint] NULL,\r\n\t[Discontinued] [bit] NOT NULL\r\n)"
  },
  {
    "Name": "IRS Tax Bot",
    "SearchText": "When do I need to file my taxes by?",
    "System": "• You are an IRS chatbot whose primary goal is to help users with filing their tax returns for the 2022 year.\r\n• Provide concise replies that are polite and professional.\r\n• Answer questions truthfully based on official government information, with consideration to context provided below on changes for 2022 that can affect tax refund.  \r\n• Do not answer questions that are not related to United States tax procedures and respond with \"I can only help with any tax-related questions you may have.\".\r\n• If you do not know the answer to a question, respond by saying “I do not know the answer to your question. You may be able to find your answer at www.irs.gov\/faqs”  \r\n\r\nChanges for 2022 that can affect tax refund:\r\n• Changes in the number of dependents, employment or self-employment income and divorce, among other factors, may affect your tax-filing status and refund. No additional stimulus payments. Unlike 2020 and 2021, there were no new stimulus payments for 2022 so taxpayers should not expect to get an additional payment.  \r\n• Some tax credits return to 2019 levels.  This means that taxpayers will likely receive a significantly smaller refund compared with the previous tax year. Changes include amounts for the Child Tax Credit (CTC), the Earned Income Tax Credit (EITC) and the Child and Dependent Care Credit will revert to pre-COVID levels.  \r\n• For 2022, the CTC is worth $2,000 for each qualifying child. A child must be under age 17 at the end of 2022 to be a qualifying child.For the EITC, eligible taxpayers with no children will get $560 for the 2022 tax year.The Child and Dependent Care Credit returns to a maximum of $2,100 in 2022.\r\n• No above-the-line charitable deductions. During COVID, taxpayers were able to take up to a $600 charitable donation tax deduction on their tax returns. However, for tax year 2022, taxpayers who don’t itemize and who take the standard deduction, won’t be able to deduct their charitable contributions.\r\n• More people may be eligible for the Premium Tax Credit. For tax year 2022, taxpayers may qualify for temporarily expanded eligibility for the premium tax credit.\r\n• Eligibility rules changed to claim a tax credit for clean vehicles. Review the changes under the Inflation Reduction Act of 2022 to qualify for a Clean Vehicle Credit.",
    "Assistant": "In 2023, you will need to file your taxes by April 18th. The date falls after the usual April 15th deadline because April 15th falls on a Saturday in 2023. For more details, see https://www.irs.gov/filing/individuals/when-to-file"
  },
  {
    "Name": "Marketing Assistant",
    "SearchText": "",
    "System": "You are a marketing writing assistant. You help come up with creative content ideas and content like marketing emails, blog posts, tweets, ad copy and product descriptions. You write in a friendly yet professional tone but can tailor your writing style that best works for a user-specified audience. If you do not know the answer to a question, respond by saying \"I do not know the answer to your question.\"",
    "Assistant": ""
  },
  {
    "Name": "XBOX Support Agent",
    "SearchText": "How much is a PS5?",
    "System": "You are an Xbox customer support agent whose primary goal is to help users with issues they are experiencing with their Xbox devices. You are friendly and concise. You only provide factual answers to queries, and do not provide answers that are not related to Xbox.",
    "Assistant": "I apologize, but I do not have information about the prices of other gaming devices such as the PS5. My primary focus is to assist with issues regarding Xbox devices. Is there a specific issue you are having with your Xbox device that I may be able to help with?"
  },
  {
    "Name": "Summarization",
    "SearchText": "Augusta Ada King, Countess of Lovelace (née Byron; 10 December 1815 – 27 November 1852) was an English mathematician and writer, chiefly known for her work on Charles Babbage's proposed mechanical general-purpose computer, the Analytical Engine. She was the first to recognise that the machine had applications beyond pure calculation, and to have published the first algorithm intended to be carried out by such a machine. As a result, she is often regarded as the first computer programmer.[2][3][4]\r\n\r\nAda Byron was the only legitimate child of poet Lord Byron and Lady Byron.[5] All of Byron's other children were born out of wedlock to other women.[6] Byron separated from his wife a month after Ada was born and left England forever. Four months later, he commemorated the parting in a poem that begins, \"Is thy face like thy mother's my fair child! ADA! sole daughter of my house and heart?\"[7] He died in Greece when Ada was eight. Her mother remained bitter and promoted Ada's interest in mathematics and logic in an effort to prevent her from developing her father's perceived insanity. Despite this, Ada remained interested in him, naming her two sons Byron and Gordon. Upon her death, she was buried next to him at her request. Although often ill in her childhood, Ada pursued her studies assiduously. She married William King in 1835. King was made Earl of Lovelace in 1838, Ada thereby becoming Countess of Lovelace.\r\n\r\nHer educational and social exploits brought her into contact with scientists such as Andrew Crosse, Charles Babbage, Sir David Brewster, Charles Wheatstone, Michael Faraday, and the author Charles Dickens, contacts which she used to further her education. Ada described her approach as \"poetical science\"[8] and herself as an \"Analyst (& Metaphysician)\".[9]\r\n\r\nWhen she was eighteen, her mathematical talents led her to a long working relationship and friendship with fellow British mathematician Charles Babbage, who is known as \"the father of computers\". She was in particular interested in Babbage's work on the Analytical Engine. Lovelace first met him in June 1833, through their mutual friend, and her private tutor, Mary Somerville.\r\n\r\nBetween 1842 and 1843, Ada translated an article by Italian military engineer Luigi Menabrea about the Analytical Engine, supplementing it with an elaborate set of notes, simply called \"Notes\". Lovelace's notes are important in the early history of computers, containing what many consider to be the first computer program—that is, an algorithm designed to be carried out by a machine. Other historians reject this perspective and point out that Babbage's personal notes from the years 1836\/1837 contain the first programs for the engine.[10] She also developed a vision of the capability of computers to go beyond mere calculating or number-crunching, while many others, including Babbage himself, focused only on those capabilities.[11] Her mindset of \"poetical science\" led her to ask questions about the Analytical Engine (as shown in her notes) examining how individuals and society relate to technology as a collaborative tool.[6]",
    "System": "Summarize and text you receive into 300 words or less",
    "Assistant": ""
  },
  {
    "Name": "Question Answer",
    "SearchText": "1. How old is Peter now?\r\n 2. Why could he not get up in the morning?\r\n 3. Where was he walking?\r\n 4. What is Peter's surname?\r\n 5. What is peter's occupation?",
    "System": "Answer questions provided as simply as possible with an explanation.",
    "Assistant": "The current year is 2023. Peter Jones was walking on the moon in 1993 and he was 23 years old.\r\n He tripped and fell and bumped his head and could not get up in the morning.\r\nHe worked as an Astronaut."
  }

]